*Eduardus Tjitrahardja | @edutjie | 2022*

# Data Loading

## Import Libraries

In [1]:
import pandas as pd

## Load Dataset

In [2]:
df = pd.read_csv("../dataset/titanic.csv")

## Inspect Dataset

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [7]:
selected_cols = ['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Fare']

In [11]:
df1 = df[selected_cols]
df1.head()

,Survived,Pclass,Name,Sex,Age,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,8.0500

In [31]:
df1.describe()

         Survived      Pclass         Age       Fare
count  887.000000  887.000000  887.000000  887.00000
mean     0.385569    2.305524   29.471443   32.30542
std      0.487004    0.836662   14.121908   49.78204
min      0.000000    1.000000    0.420000    0.00000
25%      0.000000    2.000000   20.250000    7.92500
50%      0.000000    3.000000   28.000000   14.45420
75%      1.000000    3.000000   38.000000   31.13750
max      1.000000    3.000000   80.000000  512.32920

In [36]:
df1['Age'] = df1.Age.astype('int64')
df1.dtypes

C:\Users\edutjie\AppData\Local\Temp/ipykernel_23176/1606989050.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Age'] = df1.Age.astype('int64')

Survived      int64
Pclass        int64
Name         object
Sex          object
Age           int64
Fare        float64
dtype: object

In [38]:
df1.shape

(887, 6)

## Change Columns

In [41]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [43]:
new_cols = {
    "Survived": "SURVIVED",
    "Pclass": "PCLASS",
    "Name": "NAME",
    "Sex": "SEX",
    "Age": "AGE",
    "Siblings/Spouses Aboard": "SIBSA",
    "Parents/Children Aboard": "PARCA",
    "Fare": "FARE",
}

In [44]:
df = df.rename(columns=new_cols)
df.head()

,SURVIVED,PCLASS,NAME,SEX,AGE,SIBSA,PARCA,FARE
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

## Check Empty Values

In [46]:
df.isnull().any()

SURVIVED    False
PCLASS      False
NAME        False
SEX         False
AGE         False
SIBSA       False
PARCA       False
FARE        False
dtype: bool

## Group Data

In [47]:
df.groupby(["PCLASS"]).mean()

        SURVIVED        AGE     SIBSA     PARCA       FARE
PCLASS
1       0.629630  38.788981  0.416667  0.356481  84.154687
2       0.472826  29.868641  0.402174  0.380435  20.662183
3       0.244353  25.188747  0.620123  0.396304  13.707707

## Concatenate Data

In [50]:
df2 = df[['SURVIVED', 'PCLASS', 'NAME']]
df2.head()

   SURVIVED  PCLASS                                               NAME
0         0       3                             Mr. Owen Harris Braund
1         1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2         1       3                              Miss. Laina Heikkinen
3         1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4         0       3                            Mr. William Henry Allen

In [54]:
df3 = df[['SEX', 'AGE', 'SIBSA']]
df3.head()

      SEX   AGE  SIBSA
0    male  22.0      1
1  female  38.0      1
2  female  26.0      0
3  female  35.0      1
4    male  35.0      0

In [52]:
df4 = df[['PARCA', 'FARE']]
df4.head()

   PARCA     FARE
0      0   7.2500
1      0  71.2833
2      0   7.9250
3      0  53.1000
4      0   8.0500

In [55]:
df_concatenated = pd.concat([df2, df3, df4], axis=1)
df_concatenated.head()

,SURVIVED,PCLASS,NAME,SEX,AGE,SIBSA,PARCA,FARE
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

## Save Modified DataFrame

In [56]:
df1.to_csv('../dataset/titanic_modified.csv')